#include <bits/stdc++.h>

/* Капитализация — это запись слова, в которой первая буква слова записывается как прописная буква. Ваша задача, вывести капитализацию заданного слова.

Обратите внимание, что в капитализации все буквы слова кроме первой остаются не измененными.

Входные данные
В первой строке записано непустое слово. Слово состоит из строчных и прописных букв латинского алфавита. Длина заданного слова не превосходит 103 букв.

Выходные данные
Выведите капитализацию слова.*/

int main() {
	std::string str;
	std::cin >> str;
	str[0] = toupper(str[0]);
	std::cout << str << std::endl;
	return 0;
}
